import React from 'react'
import {Button, ButtonGroup} from "reactstrap";
import {CommonChart} from "../commonChart/CommonChart";

const categories = ["Январь 2019 г.", "Февраль 2019 г.", "Март 2019 г.", "Апрель 2019 г.", "Май 2019 г.", "Июнь 2019 г.", "Июль 2019 г.", "Август 2019 г.", "Сентябрь 2019 г.", "Октябрь 2019 г.", "Ноябрь 2019 г.", "Декабрь 2019 г.", "Январь 2020 г.", "Февраль 2020 г.", "Март 2020 г.", "Апрель 2020 г.", "Май 2020 г.", "Июнь 2020 г.", "Июль 2020 г.", "Август 2020 г.", "Сентябрь 2020 г.", "Октябрь 2020 г.", "Ноябрь 2020 г.", "Декабрь 2020 г.", "Январь 2021 г.", "Февраль 2021 г.", "Март 2021 г.", "Апрель 2021 г.", "Май 2021 г.", "Июнь 2021 г.", "Июль 2021 г.", "Август 2021 г.", "Сентябрь 2021 г.", "Октябрь 2021 г.", "Ноябрь 2021 г.", "Декабрь 2021 г."];
const data = [19.2, 23.4, 20.4, 20.1, 17.8, 19.5, 19, 19.7, 19.6, 22.2, 23, 25.5, 19, 24.1, 23.5, 28.8, 25.2, 26, 28.4, 28.7, 32.9, 34.6, 31.4, 32.7, 22.2, 28.7, 28.5, 29.9, 25.7, 29.1, 25.1, 24.1, 26.1, 27.7, 27.4, 31];

export const MortgagePercentAmongAllCredits = () => {

    return <>
        {/*<h4></h4>*/}

        <CommonChart label={"Доля ипотек среди всех кредитов"}
                     categories={categories}
                     data={data}
        />
    </>
}